{"pages":[{"title":"'tag'","text":"","link":"/tags/"}],"posts":[{"title":"博客开始营业","text":"马马虎虎地也算做了很久的程序员了（或许也没那么久。 近来愈发觉得有个能自说自话的地方，对磨练自己表达能力大有裨益，于是这个小博客就开张了。 2019 年开始就慢慢从 Web 前端转 iOS 开发了，目前进展还不错，不知道从什么内容写起，就先从分享一些 SwiftUI 的实践和技巧开始吧。","link":"/posts/on-blog-launch/"},{"title":"纪念我的爸爸。","text":"2022 年 1 月 10 日，腊月初八，爸爸走了，享年 56 岁。 时间，就非要这么快吗？「BB一个啊呜Check-in」，这是以前同事霞姐的女儿跟我瞎玩的时候随口编给我的名字，虽然没什么意义但我就是记住了，现在想想这个名字挺有哲学意义的。 世上所有人都是某时某刻，「小 BB 一个，啊呜着 Check-in 到这世界」，问题是老天爷从不跟你商量什么时候你会 Check-out。 10 月底的时候，从接到爸爸确诊肝癌的噩耗，一直到爸爸去世，只有短短两个多月时间。我接到消息后立刻就动身回家，先是在汕头中心医院里陪护了一周，出院后又在家陪了爸爸一个月，之后我做了一个让我后悔很久的决定，为了老爸的医疗费我回来找工作了，这一走，就是天人两隔。 关于我的爸爸爸是土生土长的潮汕人，但跟很多人印象中的潮汕大男子主义形象相去甚远，他可吊儿郎当了，嘻嘻哈哈跟孩子们特别玩得来，小时候我爸最爱做的事就是抱我起来拿胡子渣扎我扎到哭！ 他故作深沉的时候，基本上我的屁股就要挨打了，就连打我都跟别人不一样，别人都是偷偷在家教训孩子，他非要上街追我，让我很没面子。有一次追我的时候我感觉要被他一个大巴掌呼后脑勺了，赶紧原地蹲下来，他自己惯性太大摔了一下，爬起来一边笑一边打我！ 因我太调皮，这样的苍蝇拍打屁股都打坏好几支了。 现在想来，老爸对我性格的影响是挺大的，我也没个正经时候每天嘻嘻哈哈的，也特别喜欢跟小孩子们玩。 老爸只有初中学历，听得懂普通话却不太会说，他蹩脚的普通话是我的一大快乐源泉，看他跟镇子上的外地人打交道特别有意思。 即使操着蹩脚普通话，爸爸还是把几个孩子都培养上了大学，小学的时候我有很多同学特别是女同学，读着读着家里就让退学回去帮忙赚钱了，连初中都没上，可是我们家孩子不管男孩女孩只要想读书，爸爸从没说过半个不字。即使是我这种不学无术的娃，爸也支持我去读了中专。 爸妈一直把我们几个小孩照顾得很好，这是妹妹出生前的一张家庭照。 这是妹妹三岁的时候，爸妈难得花钱去镇上照相馆拍的全家福。 那时爸爸 40 出头，眼神却充满朝气，不夸张地说精神气貌比现在很多年轻人都好多了。 为了照顾家里四个小孩，年轻时候爸爸做过很多活计： 扛着采购的一大袋小商品，连坐五天的绿皮火车去青岛摆摊做生意 去工地上给工人做饭 在镇子上开鞋店 一砖一瓦地把家里房子给盖起来了 … 爸爸干过很多活，不过爸爸最让我骄傲的职业是 “大厨师” 老爸做的菜是最好吃的，他炸的鸡腿比什么 KFC 麦当劳要好吃上百倍，鸡鸭鱼肉海鲜他样样都会做，就连早上的碎肉粥也煮得比外边馆子好吃。每年的年夜饭基本都是爸爸在张罗，对我而言所谓的年味其实就是爸爸做的饭香味。 在他身上从没有什么 “巧父难为无米之炊”。06 年「珍珠」台风登陆那段时间家里经济很困难，镇子上又处处积大水，出不了门买不了米，一家人只能躲在屋子里担心下一顿饭，爸爸却像变魔术一样从柜子里拿出一袋鱿鱼，用酒精和一个小金属盆就烤了一顿鱿鱼大餐，我至今还记得那滋味，从此酒精烤鱿鱼成了我回家跟我爸必点的菜品。 老爸做饭太香的后果就是我没办法照顾好自己，去汕头上中专之前我体重一直很正常，出去后没有爸妈管，读书那几年我甚至有点营养不良。。。 小时候的爸爸是无所不能的，大到盖房子刷油漆，小到修自行车，好像什么都会，总是抽着烟就把活干了，问他啥他都能把我唬得一愣一愣的（还骗我说米老鼠就是米缸里偷米的小老鼠，有机会就给我抓一只，到我工作了都没抓到，他是忘了，我还记得呢！）。 长大了慢慢发现爸爸也有不懂的东西，有他用不惯的洗衣机，有他不会打字的手机，也有他修不好的宽带。我回忆不起第一次我爸跟我请教电脑问题时我的神情，不过不用说一定很欠扁。 我与老爸小学的时候，放学后总要缠着爸爸骑家里的凤凰老单车载我去买菜，不是因为我多体贴会帮忙，主要是想买什么菜都是我说了算，集市里还有一家老面馆，有时候嫌我烦，爸会点一份小面把我放在里头一个人吃面，买完菜再来拎我回家。 小学时有多粘爸爸，青春期就有多烦爸爸，我的青春期非常叛逆，叛逆到我自己都觉得有点不可思议，以至于放着高中不读，自己去选了一个汕头的中专软件专业，想早点出来赚钱过独立生活，想远离父母。总之就是想方设法跟爸妈对着干，特别想证明自己。 那时候跟老爸吵过好多架，不过最后老爸还是支持我的决定，在我软磨硬磨下还给我配了台 4k 多的笔记本电脑，就让我滚去汕头读书了，入学那天是我人生第一次坐大巴车。 自打我出远门读书后，跟爸爸相处的时间就越来越少了，偶尔要生活费的时候才会厚脸皮打个电话撒撒娇，参加工作后甚至连电话都很少打了，只有逢年过节的时候才回去一段时间。 那阵子，周末回家要坐没有固定时刻表的大巴车，一直坐到镇子公路入口，老爸会骑着电动车突突突地来接我回家，路上我再跟他唧唧哇哇说一堆学校的事，周日下午老爸再突突突把我送到公路入口，陪我等车嘱咐我注意安全。 工作以后还是一样的大巴，一样的公路入口，一样的电动车突突突声，不一样的是老爸越来越白的头发，每多工作一年我都越能理解老爸的辛苦，回家路上的话却越来越少，因为觉得 “爸你该歇会儿了” 这种话太矫情。 后来我继续作死，网上找到个工作机会，就跟我爸借了几千块，买了机票来西安工作了（记得买机票那天因为价格波动，多花了200块，可心疼了）。 来了西安以后回家的次数就更少了，但每次回家爸爸都很替我骄傲，总跟别人说我特别厉害能一个人跑那么远去工作，工资还涨那么快 balabala 的，那时候我开始往家里寄钱，觉得终于能证明自己特别开心。 这幸福的日子就在今年结束了。10 月底我姐告诉我老爸脸色越来越差肚子也在变大，去中心医院检查后确诊了肝癌晚期，当时感觉天都要塌了，立马买了机票回家。 在医院看到我爸憔悴模样的时候差点就哭了，但还是强忍住了，只是抱了抱他然后开始耍宝想让他开心点。 我们不想让他知道病情，就骗他说是比较严重的肝硬化要好好调养，家里人也纠结过无数次要不要说，最后决定不要让他担心，好好过完最后的日子。 那天天气特别好，家里人都来看望爸爸，爸爸很开心一直在说话。 回汕头后的第一周，我一个人陪着老爸在医院调养，那时候他除了腹水很涨，有点憔悴以外，整个人还是很清醒的，睡得着也吃得下东西，有几次胃口好到能吃下一整碗牛肉粿条。 中心医院靠近海滨路，我偶尔会带爸爸去海边走走，一路上讲我在汕头读书工作的事挺开心的，但每每快走到海边的时候爸爸就累了，该死的肝癌让他愈发容易累了，甚至坐一会儿屁股都会很痛。 那一周每天除了打点滴，照顾三餐，削削水果以外，最开心的就是终于能敞开了跟爸爸聊天了，我回来后爸爸心情特别好，聊了很多他年轻时还有我出生前的事，讲他以前怎么种田，怎么搜罗鼓捣田里各种吃的，怎么学煮饭学修鞋，怎么坐五天火车去青岛摆摊，怎么被骗钱。。。从我老叔聊到小叔，大姑聊到小姑，聊到我们家还有个从未见过面的台湾远远远远房亲戚。 那时候我才真切感受到老爸是活了半个世纪的人了，我其实只陪他走过一半不到的人生，老爸年轻过，也有意气风发的时候，做生意被坑后也会很迷茫，但他从不跟我们说这些事，他为了我们吃过的那些苦，老实说放我身上我不一定受得了。 一周后给爸爸办理了出院手续，回家继续调养，当时医生已经告知没什么太好的治疗方案，到了晚期肝移植也不现实，只有靶向药这条路可以试试了。 回家后又过了一周，我 27 岁生日那天，没有什么蛋糕和蜡烛，因为肝癌引发的便秘，生日是陪老爸老妈在医院急诊度过的。 挺高兴的事是我弟给爸买了只鹦鹉🦜，最后这段日子里老爸每天都要逗逗这只小鹦鹉，跟小时候逗我们一样。 老爸的旧手机太卡了，我给老爸买了一部 iPhone 13，他嘴上骂我浪费钱，过没几天就真香了，每次有人来看望他都要显摆一下我给他买的 iPhone。 我姐还给搞了个麻将桌，让我爸没事教我们搓麻将。 老爸一直都很关心我，连我开发的小 App 叫什么名字他都知道，总问我是不是要开工作室要自己给自己发工资，收到钱了会不会给他提成。 最后的日子出院后爸爸的病情挺稳定的，我们一直觉得靶向药有慢慢在起作用，开始抱有希望。 谁曾想上周六早上一醒来就开始干呕吐血，身体状况开始急转直下，周天的时候爸爸已经开始神智不清，怎么喊他都没反应。 挣扎了一宿，1 月 10 号，农历腊月初八，早晨 10:37 分，爸爸永远离开了我们。 我一直想着等我攒够钱有点事业成家了，可以每年带着孩子还有爸妈四处旅游，把中国逛个遍拍一堆老年人旅游照回家里摆着得瑟，可以带着孩子义正严辞去跟爸妈把小时候的压岁钱讨回来，可以带爸妈逛大商场，包场看老电影。。。 可我偏心的爸爸啊，只给了我他抚养我长大的记忆，却不给我报答的机会，非要教我子欲养而亲不待的道理。 爸爸短暂的一生没有什么世俗意义上的大成就，更不是什么潮汕大老板，爸爸甚至有很多坏毛病，爱抽烟也爱熬夜，中年以后也爱乱发脾气。 可是爸爸做的饭世界第一好吃，爸爸用双手养活了全家人，爸爸盖的房子坚固又温馨，爸爸供我们读书，爸爸陪我们长大，爸爸带我们去海边玩，爸爸教我们游泳，爸爸带我去买菜，爸爸偷带我出去吃夜宵，爸爸过年跟我赌钱会赖账，爸爸教我劳动最光荣，爸爸收到我的红包会乐开花，爸爸用我买的手机会跟别人显摆，爸爸中年发福了会去晨跑，爸爸晨跑完会嘲讽我不挪窝，爸爸其实想跟我聊很多很多，爸爸永远是我的爸爸！！！ 爸爸是很坚强的，爸爸只是累了先休息了，爸爸放心去吧，妈妈有孩子们照顾。 答应我爸爸，如果天国有集市，等我去见你的时候，一定要骑单车载我去买菜。","link":"/posts/to-papa/"},{"title":"打造小而美，Doll - 菜单栏小助手","text":"今天给大家分享（安利）我最近开发的一个 macOS app - Doll，它能改善你的 Mac 菜单栏体验。 解决什么问题？如果你的 Mac 使用习惯也和我一样，喜欢【自动隐藏 Dock + 窗口全屏】进行日常工作，那么时不时地 遗漏工作消息 一定是你的日常。 为什么总会遗漏消息？因为全屏的时候，Menu Bar 会隐藏，自动隐藏的 Dock 又很不好调出来（甚至可能划拉了五六下都出不来）。这两个 App 常驻的位置都看不到了，那一旦你没有看到一开始的消息通知（分神了或者喝茶喝水去了），等你回来继续工作，你根本不会意识到需要去调出 Dock 看看有没有红点点（当然离开座位要锁屏噢朋友）。 非全屏模式也并非高枕无忧，我常用的 Slack，Mail，Microsoft Teams 之类的应用是没有菜单栏常驻图标的，只能通过 Dock 确认有没有新消息，你专心写代码的时候也不会时常调出 Dock。 如果应用提供了菜单栏常驻图标，那这个问题就可以很大程度上缓解，因为就算没有新消息的时候，为了看时间你也会时不时地喵上几眼菜单栏，而菜单栏比 Dock 更易见得多，就算隐藏了也只需要把鼠标移动到屏幕上方即可快速显示。 Doll 解决的就是这么一个小小小小小…众需求，它可以帮你把 Dock 上的图标和未读消息同步到菜单栏上！ 如何获取我把 Doll 开源并托管在了 Github 上，你可以去这个页面下载 dmg 安装文件 如何安装双击 dmg 文件，把 Doll.app 拖到 Application 目录 双击打开 Doll，此时系统应该会提示你这是未被验证的开发者发布的程序，不允许你打开，这是正常的因为我只是简单地发布了个未签名的 dmg 文件，并没有准备上架 App Store，点击 OK 继续。 Command + Space 打开 System Preferences &gt; Security &gt; General &gt; Open anyway 如何使用使用方法很简单，App 启动后会要求你选择一个 App 进行观测，同时你也可以进行搜索: 当你选择好要观测的 App 后，Doll 会请求你授予 Accessibility API 权限: 确保你授予了 Doll.app 使用 Accessibility API 的权限否则观测不会起任何作用。 搞定!Doll 现在会自动同步 Dock 的 App Badge 信息到菜单栏对应的图标，你不用再担心漏回消息了! 切换当前观测的 App如果被观测的 App 正在运行, 点击菜单栏图标只会简单地打开那个 App。 如果你想更改设置，只需要按住 “Option 键(⌥)“ 然后点击图标. 同时监测多个 App没有问题，点击这个小加号就行。 为什么需要 Accessibility API 权限？不会有安全隐患吧？绝对！不要！相信！互联网！ 当然有风险当然有隐患，没事不要瞎装软件。 Doll 是开源的，如果你不放心我提供的 dmg 包，随时欢迎你克隆，审查，修改代码然后编译属于你自己的安装包。 Doll？什么怪名字。Doll 这个名字来自我很喜欢的动画《黑之契约者》, 动画里如果一个 契约者 一直使用他的超能力但却从不支付 代价, 那么最终他的能力会失控，丧失自我成为毫无感情的 **Doll**，终日面无表情（误. 如果我们工作中使用了太多的 专注能力 却从来不支付 代价，我们会变成什么呢～ &gt;&gt;__&lt;&lt;. 怎么实现的？整个项目的 UI 完全由 SwiftUI 实现。 核心的获取 Badge 信息的代码存放在单独的一个叫 MonitorCore 的 Swift Package 中，使用了 macOS 的 Accessibility API，因为 API 的限制，Doll 只能通过 Polling 的方式每隔 1s 同步一次 Badge 信息，不过无需担心性能，因为每个轮询操作只是简单的读取和设置文本，而且一天最多执行 86400 次，对 Mac 来说洒洒水而已啦。 具体细节就有劳各位自己看代码啦。 近来的一些些感想学习一门新语言的建议因为最近刚加入了很优秀的 iOS 开发团队，为了不拖后腿一直在恶补 Swift 各种语法和新特性，这个学习的过程也有一些心得想分享一下。 我以前是专职前端开发的，最近一年多才慢慢接触 iOS 开发，这个小项目也是我为了用熟 Swift 语言的各种新特性给自己找的课题。 以前学一门计算机语言时我喜欢把一整本教程书啃完再动手实践，一边看书一边心里还会默念类似 “啊这都要单独写出来吗谁不懂啊”，“不就是个尾递归优化嘛又在这水页数” 的话，可每每到了看完书要动手的时候就抓瞎了，好像什么语法都懂，但就是没有兴趣用这门语言写点东西，最后往往就不了了之，过个一年半载语法又忘光了，学 Java, Python，Ruby 都是这样。 但其实我也有学得蛮好的语言，C# 尽管多年没复习了每年还是能用它写点自娱自乐的 Windows 软件，JavaScript 更不用说是看家吃饭的手艺，轮子一个接一个造，近两年来 Swift 也是用得越来越熟练，甚至还开发了一个广受好评的 App。 回顾一下我用得最好的这三门语言，发觉我反而没有系统地学过它们， C# 能学起来是因为想用 WPF 实现一个炫酷的桌面聊天软件。 JavaScript 能学起来是因为第一家公司的宣传网站是我一个人搭的。 Swift 能学起来是因为我买了 iPad 想好好看漫画而不得。 基本上稍微系统地学习这些语言都是在我已经做出了一点成果之后了，需要更精进的时候我才会去买一些书来看，而且此时我的针对性很强，我要解决的就是开发过程中遇到的非常具体的问题，要买什么书要学什么技术我基本也都门清了。 而怎么也学不好的那几门语言，是因为我就从没想好用它们做点什么，学习的动力来源非常单一：“这么火应该学”。 说出来不怕大伙笑话，什么异步多线程编程，竞态资源，自旋锁，信号量，Async Await，内存泄露排查，性能调优，我这种半路出家的刚入行那几年根本连概念都看不懂，书也看不下去。 可一旦开始写一个感兴趣的项目了，我就想提高它的稳定性，改善它的性能，各种变着法想让它更好用，于是这个过程里我就什么语言特性都学到了，用得也更扎实了，成就感是非常强的，经常解决完问题后激动地原地跺 JoJo！ 说到底计算机科学还是更偏向实践一些，因此对于语言初学者，不管你在学什么语言，我的建议是学完简单的基础后就先把书合起来吧，马上动手去做点东西才能保住你那份热情，前期多做，后期多学，会是正反馈周期比较合理的方式。 iOS 开发的效率搞 iOS 开发的同学们，SwiftUI 现在必须立刻马上武装到你的技能树上，投资回报率是近几年最高的了！ Doll 仅仅花了我 3 个晚上就写完了，90% 的时间其实花在了查 macOS 的 API 文档上，UI 部分可以说毫无阻力，想哪写哪，随时预览随时调节。 虽然因为用了较新的 SwiftUI 所以 Doll 只能跑在 macOS 11.0(Big Sur) 以上的系统，但这个牺牲完全值得！如果我为了兼容老系统改用 UIKit 实现界面，我这会儿应该还在纠结为什么 UICollectionViewDataSource 就是不更新，Layout Constraints 应该 Enable 哪几个，Disable 哪几个，要怎么实现数据绑定。。。等我实现出一版 UIKit，竞品早已经迭代了好几版 UI 了。 规划虽然说有想法就赶紧上机开码的感觉特别爽（谁开机谁知道），但该缓一缓的时候还是得及时刹车。 开发 Doll 的时候我就犯了急性子的大错，想当然觉得全屏模式时，应该在有新消息的时候显示一个小小的通知 Popover 好让用户注意到。为了实现这个 Popover 又花了一小时查怎么确定当前窗口是全屏模式（实名吐槽 Apple 烂文档，交了那么多钱就这体验），然后又一顿调试终于实现了。 最后当我在全屏模式下发了一条测试消息的时候，我傻眼了： 你说这一个多小时能找谁要回来？其实脑子只要停下来想一想马上就能意识到这个功能鸡肋至极，可是脑子说不行，你不能停，这个 idea 太棒了用户一定会赞不绝口的！ 这种错我还是偶尔会犯，对抗本能太难了，这个鸡肋功能就留在 Doll 里作为提醒吧。 最后希望 Doll 这个小作品能小小地提高大家的工作体验，也祝愿各位大姑娘小伙子们能找回那种开发软件解决问题的纯粹乐趣。","link":"/posts/doll-the-badge-catcher/"}],"tags":[{"name":"Flag","slug":"Flag","link":"/tags/Flag/"},{"name":"Life","slug":"Life","link":"/tags/Life/"},{"name":"Doll","slug":"Doll","link":"/tags/Doll/"},{"name":"Menu bar","slug":"Menu-bar","link":"/tags/Menu-bar/"},{"name":"Productivity","slug":"Productivity","link":"/tags/Productivity/"}],"categories":[{"name":"人生","slug":"人生","link":"/categories/%E4%BA%BA%E7%94%9F/"},{"name":"gallery","slug":"gallery","link":"/categories/gallery/"}]}